%作者：吕丽娟
%班级：车辆2003班
%时间：2023/3/9
%第一次作业
%用最小二乘法进行线性拟合，采用解正规矩阵求解一次函数的参数方法

%设置数据样本
X = [0;5;10;15;20;25;30;35;40;45;50];
Y = [0.3;5.6;9.8;14.5;20.1;25.5;29.7;36;40.1;45;49.9];

% 构建矩阵A和向量b
A = [X ones([size(X),1])];
b = Y;

% 求解最小二乘问题Ax=b，得到最小二乘解c，
c = A\b;

% 样本点测试值
xfit = X;
yfit= c(1)*xfit + c(2);

% 计算残差并输出拟合公式
error = b - A*c;
disp(['y=' num2str(c(1)) 'x+' num2str(c(2))])
disp(['error^2=' num2str(sum(error.^2))])

% 绘制散点图和拟合直线
plot(X,Y,'o')
hold on
plot(xfit,yfit,'r')
title('最小二乘拟合')
xlabel('X')
ylabel('Y')


